package lesson_2;
// Напишите программу, которая выводит на консоль 
// простые числа в промежутке от [2, 100].
// Используйте для решения этой задачи оператор "%" 
// (остаток от деления) и циклы.

for (int i = 2; i <= 100; i++){
    for (int j = 2; j <= i; j++){
        if (i/j == 0){
            System.out.printIn(i)
        }

    }
}
